package my.ylab.homework02.sequences;

public interface Sequences {
    /**
     * Выводит в консоль n первых членов последовательности A
     * A: 2, 4, 6, 8, 10...
     * @param n - число членов последовательности для вывода
     */
    void a(int n);

    /**
     * Выводит в консоль n первых членов последовательности B
     * B: 1, 3, 5, 7, 9...
     * @param n - число членов последовательности для вывода
     */
    void b(int n);

    /**
     * Выводит в консоль n первых членов последовательности C
     * C: 1, 4, 9, 16, 25...
     * @param n - число членов последовательности для вывода
     */
    void c(int n);

    /**
     * Выводит в консоль n первых членов последовательности D
     * D: 1, 8, 27, 64, 125...
     * @param n - число членов последовательности для вывода
     */
    void d(int n);

    /**
     * Выводит в консоль n первых членов последовательности E
     * E: 1, -1, 1, -1, 1, -1...
     * @param n - число членов последовательности для вывода
     */
    void e(int n);

    /**
     * Выводит в консоль n первых членов последовательности F
     * F: 1, -2, 3, -4, 5, -6...
     * @param n - число членов последовательности для вывода
     */
    void f(int n);

    /**
     * Выводит в консоль n первых членов последовательности G
     *  G: 1, -4, 9, -16, 25....
     * @param n - число членов последовательности для вывода
     */
    void g(int n);

    /**
     * Выводит в консоль n первых членов последовательности H
     * H: 1, 0, 2, 0, 3, 0, 4....
     * @param n - число членов последовательности для вывода
     */
    void h(int n);

    /**
     * Выводит в консоль n первых членов последовательности I
     * I: 1, 2, 6, 24, 120, 720...
     * @param n - число членов последовательности для вывода
     */
    void i(int n);

    /**
     * Выводит в консоль n первых членов последовательности J
     * J: 1, 1, 2, 3, 5, 8, 13, 21…
     * @param n - число членов последовательности для вывода
     */
    void j(int n);
}
